part_2/result/benchmark_1000000_10.txt
--------------------------------------------------
Benchmark: 1000000 requests, 10 parallel connections
Commands: SET & GET (without pipelining)
--------------------------------------------------
WARNING: Could not fetch server CONFIG
====== SET ======
  1000000 requests completed in 14.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.039 milliseconds (cumulative count 82)
50.000% <= 0.087 milliseconds (cumulative count 516960)
75.000% <= 0.111 milliseconds (cumulative count 760586)
87.500% <= 0.143 milliseconds (cumulative count 879983)
93.750% <= 0.183 milliseconds (cumulative count 940829)
96.875% <= 0.231 milliseconds (cumulative count 969033)
98.438% <= 0.319 milliseconds (cumulative count 984712)
99.219% <= 0.455 milliseconds (cumulative count 992292)
99.609% <= 0.703 milliseconds (cumulative count 996127)
99.805% <= 1.055 milliseconds (cumulative count 998048)
99.902% <= 1.551 milliseconds (cumulative count 999030)
99.951% <= 2.375 milliseconds (cumulative count 999513)
99.976% <= 2.879 milliseconds (cumulative count 999759)
99.988% <= 3.207 milliseconds (cumulative count 999878)
99.994% <= 3.407 milliseconds (cumulative count 999941)
99.997% <= 4.223 milliseconds (cumulative count 999970)
99.998% <= 4.303 milliseconds (cumulative count 999985)
99.999% <= 4.711 milliseconds (cumulative count 999994)
100.000% <= 5.327 milliseconds (cumulative count 999997)
100.000% <= 6.151 milliseconds (cumulative count 1000000)
100.000% <= 6.151 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
70.511% <= 0.103 milliseconds (cumulative count 705111)
95.902% <= 0.207 milliseconds (cumulative count 959024)
98.298% <= 0.303 milliseconds (cumulative count 982976)
99.045% <= 0.407 milliseconds (cumulative count 990451)
99.347% <= 0.503 milliseconds (cumulative count 993468)
99.505% <= 0.607 milliseconds (cumulative count 995055)
99.613% <= 0.703 milliseconds (cumulative count 996127)
99.684% <= 0.807 milliseconds (cumulative count 996841)
99.740% <= 0.903 milliseconds (cumulative count 997404)
99.787% <= 1.007 milliseconds (cumulative count 997874)
99.823% <= 1.103 milliseconds (cumulative count 998231)
99.851% <= 1.207 milliseconds (cumulative count 998508)
99.872% <= 1.303 milliseconds (cumulative count 998716)
99.886% <= 1.407 milliseconds (cumulative count 998857)
99.897% <= 1.503 milliseconds (cumulative count 998975)
99.908% <= 1.607 milliseconds (cumulative count 999080)
99.917% <= 1.703 milliseconds (cumulative count 999171)
99.922% <= 1.807 milliseconds (cumulative count 999222)
99.929% <= 1.903 milliseconds (cumulative count 999294)
99.935% <= 2.007 milliseconds (cumulative count 999349)
99.940% <= 2.103 milliseconds (cumulative count 999397)
99.984% <= 3.103 milliseconds (cumulative count 999838)
99.996% <= 4.103 milliseconds (cumulative count 999963)
99.999% <= 5.103 milliseconds (cumulative count 999995)
100.000% <= 6.103 milliseconds (cumulative count 999998)
100.000% <= 7.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 71347.03 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.107     0.032     0.087     0.199     0.399     6.151
====== GET ======
  1000000 requests completed in 16.98 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.039 milliseconds (cumulative count 40)
50.000% <= 0.103 milliseconds (cumulative count 538144)
75.000% <= 0.143 milliseconds (cumulative count 774902)
87.500% <= 0.191 milliseconds (cumulative count 885442)
93.750% <= 0.255 milliseconds (cumulative count 940764)
96.875% <= 0.359 milliseconds (cumulative count 969747)
98.438% <= 0.519 milliseconds (cumulative count 984765)
99.219% <= 0.743 milliseconds (cumulative count 992254)
99.609% <= 1.039 milliseconds (cumulative count 996116)
99.805% <= 1.415 milliseconds (cumulative count 998072)
99.902% <= 1.991 milliseconds (cumulative count 999025)
99.951% <= 2.607 milliseconds (cumulative count 999514)
99.976% <= 3.103 milliseconds (cumulative count 999757)
99.988% <= 3.479 milliseconds (cumulative count 999878)
99.994% <= 4.359 milliseconds (cumulative count 999939)
99.997% <= 5.639 milliseconds (cumulative count 999970)
99.998% <= 5.703 milliseconds (cumulative count 999986)
99.999% <= 5.743 milliseconds (cumulative count 999993)
100.000% <= 6.367 milliseconds (cumulative count 999997)
100.000% <= 8.239 milliseconds (cumulative count 999999)
100.000% <= 9.479 milliseconds (cumulative count 1000000)
100.000% <= 9.479 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
53.814% <= 0.103 milliseconds (cumulative count 538144)
90.532% <= 0.207 milliseconds (cumulative count 905321)
95.815% <= 0.303 milliseconds (cumulative count 958152)
97.619% <= 0.407 milliseconds (cumulative count 976189)
98.393% <= 0.503 milliseconds (cumulative count 983928)
98.840% <= 0.607 milliseconds (cumulative count 988404)
99.132% <= 0.703 milliseconds (cumulative count 991323)
99.337% <= 0.807 milliseconds (cumulative count 993365)
99.476% <= 0.903 milliseconds (cumulative count 994757)
99.585% <= 1.007 milliseconds (cumulative count 995846)
99.662% <= 1.103 milliseconds (cumulative count 996619)
99.729% <= 1.207 milliseconds (cumulative count 997290)
99.774% <= 1.303 milliseconds (cumulative count 997736)
99.804% <= 1.407 milliseconds (cumulative count 998044)
99.833% <= 1.503 milliseconds (cumulative count 998334)
99.853% <= 1.607 milliseconds (cumulative count 998535)
99.869% <= 1.703 milliseconds (cumulative count 998685)
99.884% <= 1.807 milliseconds (cumulative count 998838)
99.894% <= 1.903 milliseconds (cumulative count 998939)
99.904% <= 2.007 milliseconds (cumulative count 999043)
99.912% <= 2.103 milliseconds (cumulative count 999123)
99.976% <= 3.103 milliseconds (cumulative count 999757)
99.992% <= 4.103 milliseconds (cumulative count 999920)
99.996% <= 5.103 milliseconds (cumulative count 999956)
99.999% <= 6.103 milliseconds (cumulative count 999993)
100.000% <= 7.103 milliseconds (cumulative count 999997)
100.000% <= 8.103 milliseconds (cumulative count 999998)
100.000% <= 9.103 milliseconds (cumulative count 999999)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 58910.16 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.133     0.032     0.103     0.279     0.663     9.479