part_2/result/benchmark_1000000_1000.txt
--------------------------------------------------
Benchmark: 1000000 requests, 1000 parallel connections
Commands: SET & GET (without pipelining)
--------------------------------------------------
WARNING: Could not fetch server CONFIG
====== SET ======
  1000000 requests completed in 19.13 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.455 milliseconds (cumulative count 2)
50.000% <= 9.335 milliseconds (cumulative count 500839)
75.000% <= 10.559 milliseconds (cumulative count 750731)
87.500% <= 11.663 milliseconds (cumulative count 875559)
93.750% <= 12.815 milliseconds (cumulative count 937530)
96.875% <= 14.031 milliseconds (cumulative count 968798)
98.438% <= 15.511 milliseconds (cumulative count 984424)
99.219% <= 17.023 milliseconds (cumulative count 992191)
99.609% <= 19.247 milliseconds (cumulative count 996098)
99.805% <= 26.591 milliseconds (cumulative count 998052)
99.902% <= 33.023 milliseconds (cumulative count 999050)
99.951% <= 35.615 milliseconds (cumulative count 999512)
99.976% <= 37.823 milliseconds (cumulative count 999764)
99.988% <= 38.655 milliseconds (cumulative count 999884)
99.994% <= 39.103 milliseconds (cumulative count 999942)
99.997% <= 39.711 milliseconds (cumulative count 999971)
99.998% <= 39.839 milliseconds (cumulative count 999986)
99.999% <= 40.159 milliseconds (cumulative count 999993)
100.000% <= 43.487 milliseconds (cumulative count 999997)
100.000% <= 43.711 milliseconds (cumulative count 999999)
100.000% <= 43.807 milliseconds (cumulative count 1000000)
100.000% <= 43.807 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 3.103 milliseconds (cumulative count 32)
0.008% <= 4.103 milliseconds (cumulative count 82)
0.011% <= 5.103 milliseconds (cumulative count 110)
0.127% <= 6.103 milliseconds (cumulative count 1270)
1.408% <= 7.103 milliseconds (cumulative count 14078)
10.760% <= 8.103 milliseconds (cumulative count 107600)
41.766% <= 9.103 milliseconds (cumulative count 417663)
68.761% <= 10.103 milliseconds (cumulative count 687611)
81.935% <= 11.103 milliseconds (cumulative count 819351)
90.566% <= 12.103 milliseconds (cumulative count 905656)
94.663% <= 13.103 milliseconds (cumulative count 946630)
96.993% <= 14.103 milliseconds (cumulative count 969931)
98.145% <= 15.103 milliseconds (cumulative count 981455)
98.809% <= 16.103 milliseconds (cumulative count 988091)
99.256% <= 17.103 milliseconds (cumulative count 992561)
99.489% <= 18.111 milliseconds (cumulative count 994886)
99.592% <= 19.103 milliseconds (cumulative count 995917)
99.697% <= 20.111 milliseconds (cumulative count 996972)
99.746% <= 21.103 milliseconds (cumulative count 997462)
99.759% <= 22.111 milliseconds (cumulative count 997585)
99.773% <= 23.103 milliseconds (cumulative count 997726)
99.781% <= 24.111 milliseconds (cumulative count 997807)
99.784% <= 25.103 milliseconds (cumulative count 997841)
99.788% <= 26.111 milliseconds (cumulative count 997884)
99.808% <= 27.103 milliseconds (cumulative count 998083)
99.813% <= 28.111 milliseconds (cumulative count 998130)
99.832% <= 29.103 milliseconds (cumulative count 998323)
99.856% <= 30.111 milliseconds (cumulative count 998559)
99.869% <= 31.103 milliseconds (cumulative count 998687)
99.890% <= 32.111 milliseconds (cumulative count 998900)
99.910% <= 33.119 milliseconds (cumulative count 999101)
99.926% <= 34.111 milliseconds (cumulative count 999256)
99.946% <= 35.103 milliseconds (cumulative count 999461)
99.952% <= 36.127 milliseconds (cumulative count 999523)
99.964% <= 37.119 milliseconds (cumulative count 999643)
99.984% <= 38.111 milliseconds (cumulative count 999836)
99.994% <= 39.103 milliseconds (cumulative count 999942)
99.999% <= 40.127 milliseconds (cumulative count 999992)
99.999% <= 41.119 milliseconds (cumulative count 999993)
99.999% <= 43.103 milliseconds (cumulative count 999994)
100.000% <= 44.127 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 52284.85 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        9.816     2.448     9.335    13.223    16.479    43.807
====== GET ======
  1000000 requests completed in 18.10 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.935 milliseconds (cumulative count 1)
50.000% <= 9.031 milliseconds (cumulative count 502274)
75.000% <= 9.639 milliseconds (cumulative count 750818)
87.500% <= 10.423 milliseconds (cumulative count 875651)
93.750% <= 11.447 milliseconds (cumulative count 937824)
96.875% <= 12.399 milliseconds (cumulative count 968849)
98.438% <= 13.375 milliseconds (cumulative count 984381)
99.219% <= 14.111 milliseconds (cumulative count 992220)
99.609% <= 14.871 milliseconds (cumulative count 996110)
99.805% <= 16.135 milliseconds (cumulative count 998057)
99.902% <= 17.087 milliseconds (cumulative count 999025)
99.951% <= 18.687 milliseconds (cumulative count 999512)
99.976% <= 19.439 milliseconds (cumulative count 999759)
99.988% <= 19.823 milliseconds (cumulative count 999879)
99.994% <= 20.127 milliseconds (cumulative count 999946)
99.997% <= 20.191 milliseconds (cumulative count 999970)
99.998% <= 22.271 milliseconds (cumulative count 999985)
99.999% <= 23.871 milliseconds (cumulative count 999993)
100.000% <= 28.159 milliseconds (cumulative count 999997)
100.000% <= 31.183 milliseconds (cumulative count 999999)
100.000% <= 34.847 milliseconds (cumulative count 1000000)
100.000% <= 34.847 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 2.007 milliseconds (cumulative count 8)
0.001% <= 2.103 milliseconds (cumulative count 14)
0.009% <= 3.103 milliseconds (cumulative count 86)
0.020% <= 4.103 milliseconds (cumulative count 200)
0.045% <= 5.103 milliseconds (cumulative count 450)
0.413% <= 6.103 milliseconds (cumulative count 4125)
1.655% <= 7.103 milliseconds (cumulative count 16550)
13.527% <= 8.103 milliseconds (cumulative count 135273)
53.897% <= 9.103 milliseconds (cumulative count 538974)
84.188% <= 10.103 milliseconds (cumulative count 841876)
91.988% <= 11.103 milliseconds (cumulative count 919881)
96.161% <= 12.103 milliseconds (cumulative count 961606)
98.078% <= 13.103 milliseconds (cumulative count 980783)
99.217% <= 14.103 milliseconds (cumulative count 992169)
99.668% <= 15.103 milliseconds (cumulative count 996677)
99.802% <= 16.103 milliseconds (cumulative count 998018)
99.904% <= 17.103 milliseconds (cumulative count 999036)
99.943% <= 18.111 milliseconds (cumulative count 999429)
99.963% <= 19.103 milliseconds (cumulative count 999627)
99.993% <= 20.111 milliseconds (cumulative count 999932)
99.998% <= 21.103 milliseconds (cumulative count 999977)
99.998% <= 22.111 milliseconds (cumulative count 999984)
99.999% <= 23.103 milliseconds (cumulative count 999988)
99.999% <= 24.111 milliseconds (cumulative count 999993)
99.999% <= 26.111 milliseconds (cumulative count 999994)
100.000% <= 27.103 milliseconds (cumulative count 999996)
100.000% <= 29.103 milliseconds (cumulative count 999997)
100.000% <= 30.111 milliseconds (cumulative count 999998)
100.000% <= 32.111 milliseconds (cumulative count 999999)
100.000% <= 35.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 55236.41 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        9.225     1.928     9.031    11.759    13.879    34.847